{
  "Nav": {
    "home": "Início",
    "projects": "Projetos",
    "contato": "Contato",
    "sobre": "Sobre"
  },

  "Info": {
    "dev": "Desenvolvedor Full-Stack",
    "hi": "Olá! Eu sou o Luccas Davi",
    "description": "Desenvolvedor full-stack apaixonado por tecnologia, criatividade e aprendizado contínuo. Aqui você vai encontrar projetos que refletem minha jornada, meu esforço e minha vontade de crescer na área."
  },

  "About": {
    "title": "Sobre Mim",
    "description": "Sou desenvolvedor Full-Stack apaixonado por soluções digitais funcionais. Tenho um olhar atento para a experiência do usuário e busco o equilíbrio entre desempenho, acessibilidade e design intuitivo. \n\n Gosto de entender o propósito por trás de cada projeto, curioso por natureza, estou sempre aprendendo, explorando novas abordagens e evoluindo como profissional. \n Para mim, cada linha de código é uma oportunidade de expressar criatividade, resolver problemas e construir algo que realmente faça diferença.",
    "phase": "Sou feito de tudo aquilo que amo.",
    "Academic": {
      "title": "Minha Jornada Academica",
      "description": "Cada formação que busquei teve um papel fundamental no desenvolvimento das minhas habilidades técnicas e para minha carreira como desenvolvedor.",
      "titulos": {
        "form1": {
          "title": "Análise e Desenvolvimento de Sistemas",
          "description": "Curso superior focado na criação de sistemas, lógica de programação, BD e estrutura de software"
        },
        "form2": {
          "title": "Desenvolvimento de Sistemas",
          "description": "Curso técnico que marcou o início da minha jornada. Aprendi os fundamentos do desenvolvimento web, mobile e desktop, além de participar de projetos em equipe."
        },
        "form3": {
          "title": "English",
          "description": "Formação voltada ao aprimoramento da comunicação em inglês, com foco em leitura técnica, conversação e escrita."
        }
      }
    }
  },

  "Tech": {
    "title": "Minhas Tecnologias",
    "description": "Estou explorando diversas tecnologias que me permitem criar soluções completas, modernas e escaláveis.",
    "tech-stacks": {
      "react-dec": "Biblioteca JavaScript declarativa e eficiente para construir interfaces de usuário modernas, especialmente aplicações de página única (SPA).",
      "next-dec": "Framework baseado em React que oferece renderização híbrida (SSR/SSG), roteamento automático e excelente performance para apps web escaláveis.",
      "tailwind-dec": "Framework CSS utilitário que permite criar layouts responsivos e modernos diretamente com classes, sem sair do HTML.",
      "node-dec": "Ambiente de execução JavaScript do lado do servidor que permite criar APIs, sistemas backend e ferramentas CLI com alta performance.",
      "express-dec": "Framework minimalista e flexível para Node.js, usado para construir APIs e aplicações web de forma rápida e eficiente.",
      "type-dec": "Superset do JavaScript que adiciona tipagem estática ao código, ajudando a evitar erros e melhorar a manutenibilidade de aplicações.",
      "prisma-dec": "ORM moderno para Node.js e TypeScript que facilita o acesso e a manipulação de bancos de dados relacionais com tipagem segura.",
      "mysql-dec": "Sistema de gerenciamento de banco de dados relacional amplamente utilizado, conhecido por sua performance, confiabilidade e facilidade de uso.",
      "java-dec": "Linguagem de programação orientada a objetos, robusta e multiplataforma, muito usada em aplicações corporativas e desenvolvimento Android.",
      "python-dec": "Linguagem de programação versátil, simples e poderosa, muito popular para automação, análise de dados, desenvolvimento web e inteligência artificial."
    },
    "stats-proj": "projetos finalizados",
    "stats-year": "anos de experiência"
  },

  "Projects": {
    "title": "Conheça meus projetos",
    "description": "Aqui você encontra alguns dos projetos que desenvolvi para colocar em prática meus conhecimentos, testar novas ideias e resolver problemas reais.",
    "filter": "Filtrar por linguagem",
    "button-see": "Ver",
    "titles-search": "Projetos encontrados",
    "Project1": {
      "title": "Verificador de Clima",
      "description": "Aplicação que consulta a API OpenWeather e exibe a previsão do tempo para qualquer cidade do mundo."
    },
    "Project2": {
      "title": "Gerenciador de Senhas",
      "description": "Gere senhas seguras e personalizadas com diferentes critérios de complexidade."
    },
    "Project3": {
      "title": "Conversor de Bases",
      "description": "Converta números entre diferentes sistemas numéricos de forma simples e rápida."
    },
    "Project4": {
      "title": "Portfólio",
      "description": "Este portfólio foi desenvolvido usando React e Tailwind CSS, destacando minhas habilidades e projetos."
    },
    "Project5": {
      "title": "Bookboxd",
      "description": "Pesquise obras com facilidade e veja os detalhes técnicos."
    }
  },

  "Modal": {
    "linkedin": "Rede profissional para conectar com colegas e oportunidades de trabalho.",
    "github": "Plataforma de desenvolvimento colaborativo para hospedar e revisar código.",
    "dev": "Comunidade de desenvolvedores para compartilhar conhecimento e experiências.",
    "email": "Entre em contato direto para discussões profissionais ou colaborações."
  },

  "Contact": {
    "title": "Fale comigo",
    "description": "Quer conversar, tirar dúvidas, dar feedback ou até iniciar uma colaboração? Estou por aqui!",
    "name": "Nome",
    "type": "Tipo de contato",
    "typeOptions": {
      "job": "Oportunidade de Trabalho",
      "partner": "Parceria",
      "question": "Dúvida",
      "feedback": "Sugestão",
      "other": "Outro"
    },
    "messagePlaceholder": "Escreva sua mensagem aqui...",
    "message": "Mensagem",
    "send": "Enviar",

    "Social": {
      "title": "Conecte-se Comigo!",
      "description": "Estou sempre aberto a trocar ideias, compartilhar conhecimento e conhecer novas pessoas da área."
    }
  },

  "Footer": {
    "text": "Desenvolvido por ",
    "direitos": "Todos os direitos reservados."
  }
}